app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (category_id=1 AND published=true) ORDER BY published_at DESC LIMIT 0, 10
---
  def index
    if params[:category_id]
      @articles_pages, @articles = paginate(:articles,
        :include => :user,
        :order => 'published_at DESC',
        :conditions => "category_id=#{params[:category_id].to_i} AND published=true")
    else
      @articles = Article.find_all_by_published(true)

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `articles` WHERE (`articles`.`published` = 1 AND `articles`.`id` = '1') LIMIT 1
---
  def show
     if is_logged_in? && @logged_in_user.has_role?('Editor')
      @article = Article.find(params[:id])
    else
      @article = Article.find_by_id_and_published(params[:id], true)

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`updated_at`, `title`, `body`, `published`, `category_id`, `user_id`, `published_at`, `synopsis`, `created_at`) VALUES('2009-12-30 08:15:12', 'skygoal', 'asdfasdfasdf sadf asd fsdaf ', 1, 1, 0, '2009-12-30 08:15:12', 'asdfa sdfasd fasdf asdf ', '2009-12-30 08:15:12')
---
  def create
    @article = Article.create(params[:article])