app/controllers/forums_controller.rb

SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
---
  def edit
    @forum = Forum.find(params[:id])

INSERT INTO `forums` (`name`, `updated_at`, `topics_count`, `description`, `created_at`) VALUES('002', '2009-12-30 08:33:51', 0, 'sdafsdasf', '2009-12-30 08:33:51')
---
  def create
    @forum = Forum.new(params[:forum])

    respond_to do |format|
      if @forum.save

SELECT * FROM `forums` WHERE (`forums`.`id` = 1)
DELETE FROM `forums` WHERE `id` = 1
---
  def destroy
    @forum = Forum.find(params[:id])
    @forum.destroy