app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 0)
---
  def show
    @page = Page.find(params[:id].to_i)

INSERT INTO `pages` (`permalink`, `updated_at`, `title`, `body`, `created_at`) VALUES('001', '2009-12-28 11:40:57', '001', 'hello world!', '2009-12-28 11:40:57')
---
  def create
    @page = Page.new(params[:page])
    @page.save!

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def edit
    @page = Page.find(params[:id].to_i)

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
UPDATE `pages` SET `body` = '222222222222', `updated_at` = '2009-12-28 13:01:14' WHERE `id` = 3
---
  def update
    @page = Page.find(params[:id].to_i)
    @page.attributes = params[:page]
    @page.save!

SELECT * FROM `pages` WHERE (`pages`.`id` = 5)
DELETE FROM `pages` WHERE `id` = 5
---
  def destroy
    @page = Page.find(params[:id].to_i)
    if @page.destroy