app/controllers/photos_controller.rb

  def index
    photos_count = Photo.count(:conditions => 'thumbnail IS NULL')
    @photo_pages = Paginator.new(self, photos_count, 9, params[:page])
    @photos = Photo.find(:all,
                         :conditions => 'thumbnail IS NULL',
                         :order => 'created_at DESC',
                         :limit => @photo_pages.items_per_page,
                         :offset => @photo_pages.current.offset)
---
SELECT count(*) AS count_all FROM `photos` WHERE (thumbnail IS NULL)
SELECT * FROM `photos` WHERE (thumbnail IS NULL) ORDER BY created_at DESC LIMIT 0, 9