app/controllers/posts_controller.rb

  def index
    @topic = Topic.find(params[:topic_id], :include => :forum)
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
SELECT * FROM `topics` WHERE (`topics`.`id` = 13)

  def new
    @topic = Topic.find(params[:topic_id], :include => :forum)
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
SELECT * FROM `topics` WHERE (`topics`.`id` = 18)

  def create
    @topic = Topic.find(params[:topic_id])
    @post = Post.new(:body => params[:post][:body],
                     :topic_id => @topic.id,
                     :user_id => logged_in_user.id)

    respond_to do |format|
      if @post.save
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 18)
INSERT INTO `posts` (`topic_id`, `updated_at`, `body`, `user_id`, `created_at`) VALUES(18, '2009-12-31 01:45:28', 'sdfasdfsdf', 14, '2009-12-31 01:45:28')

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 29)
DELETE FROM `posts` WHERE `id` = 29