app/controllers/roles_controller.rb

  def index
    @user = User.find(params[:user_id])
    @all_roles = Role.all
---
SELECT * FROM `users` WHERE (`users`.`id` = 14)
SELECT * FROM `roles`

  def update
    @user = User.find(params[:user_id])
    @role = Role.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 14)
SELECT * FROM `roles` WHERE (`roles`.`id` = 2)