app/controllers/topics_controller.rb

  def index
    @forum = Forum.find(params[:forum_id])
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 1)

  def create
    @forum_id=$fid
    @topic = Topic.new(:name => params[:topic][:name],
                       :forum_id => @forum_id, # debug: cannot catch the forum_id
                       :user_id => logged_in_user.id)
    @topic.save!

    @post = Post.new(:body => params[:post][:body],
                     :topic_id => @topic.id,
                     :user_id => logged_in_user.id)
    @post.save!
---
INSERT INTO `topics` (`name`, `updated_at`, `forum_id`, `posts_count`, `user_id`, `created_at`) VALUES('topic01', '2009-12-30 01:39:00', NULL, 0, 20, '2009-12-30 01:39:00')
INSERT INTO `posts` (`topic_id`, `updated_at`, `body`, `user_id`, `created_at`) VALUES(1, '2009-12-30 01:39:01', 'adfadfsasdafdsf', 20, '2009-12-30 01:39:01')

  def destroy
    @topic = Topic.find(params[:id])
    @topic.posts.each { |post| post.destroy }
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 20)
DELETE FROM `posts` WHERE ((topic_id = 20))
DELETE FROM `topics` WHERE `id` = 20
SELECT * FROM `posts` WHERE (`posts`.topic_id = 20)