app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `photos` WHERE (`photos`.user_id = 1) ORDER BY created_at DESC LIMIT 3
---
  def show
    @user = User.find(params[:id])
    @photos = @user.photos.find(:all, :limit => 3, :order => 'created_at DESC')

SELECT * FROM `users` WHERE (`users`.`username` = '1') LIMIT 1
---
  def show_by_username
    @user = User.find_by_username(params[:username])

INSERT INTO `users` (`last_login`, `updated_at`, `hashed_password`, `profile`, `username`, `enabled`, `posts_count`, `email`, `created_at`) VALUES(NULL, '2009-12-30 00:58:24', '6fe394af198717423f8f34d6ba7c57db181b35f5690144d6979d66626239a3b2', 'dongg', 'dongg', NULL, 0, 'dongg', '2009-12-30 00:58:24')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 12)
UPDATE `users` SET `hashed_password` = '1ce5bef5e151213306ac26e4a3bf8de32e93fdafbe827b50465d05199dead0a1', `updated_at` = '2009-12-29 05:29:39' WHERE `id` = 12
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 14)
UPDATE `users` SET `enabled` = 1, `updated_at` = '2009-12-30 08:15:57' WHERE `id` = 8
---
  def enable
    @user = User.find(params[:id])
    if @user.update_attribute(:enabled, true)