app/controllers/user_photos_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT count(*) AS count_all FROM `photos` WHERE (`photos`.user_id = 1)
SELECT * FROM `photos` WHERE (`photos`.user_id = 1) ORDER BY created_at DESC LIMIT 0, 9
---
  def index
    @user = User.find(params[:user_id])
    @photo_pages = Paginator.new(self, @user.photos.count, 9, params[:page])
    @photos = @user.photos.find(:all, :order => 'created_at DESC',
                                :limit => @photo_pages.items_per_page,
                                :offset => @photo_pages.current.offset)

SELECT * FROM `photos` WHERE (`photos`.`user_id` = '1' AND `photos`.`id` = '1') LIMIT 1
---
  def show
    @photo = Photo.find_by_user_id_and_id(params[:user_id],
                                          params[:id],
                                          :include => :user)

SELECT * FROM `photos` WHERE (`photos`.`id` = 2 AND (`photos`.user_id = 1))
---
  def edit
    @photo = @logged_in_user.photos.find(params[:id])

INSERT INTO `photos` (`content_type`, `thumbnail`, `size`, `updated_at`, `title`, `body`, `filename`, `height`, `user_id`, `path`, `parent_id`, `width`, `created_at`) VALUES('image/jpeg', NULL, 103095, '2009-12-30 15:09:32', 'aaaa', 'aaaaaa', '115370a6904.jpg', NULL, 1, NULL, NULL, NULL, '2009-12-30 15:09:32')
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
    if @logged_in_user.photos << @photo

SELECT * FROM `photos` WHERE (`photos`.`id` = 3 AND (`photos`.user_id = 1))
UPDATE `photos` SET `height` = 480, `width` = 293, `updated_at` = '2009-12-31 16:55:32' WHERE `id` = 3
---
  def update
    @photo = @logged_in_user.photos.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT * FROM `photos` WHERE (`photos`.`id` = 2 AND (`photos`.user_id = 1))
DELETE FROM `photos` WHERE `id` = 2
---
  def destroy
    @photo = @logged_in_user.photos.find(params[:id])
    @photo.destroy

SELECT * FROM `photos` WHERE (`photos`.`id` = 3 AND (`photos`.user_id = 1))
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'Photo') AND (`taggings`.taggable_id = 1)) ORDER BY tags.id DESC LIMIT 1
---
  def add_tag
    @photo = @logged_in_user.photos.find(params[:id])

    # Exception: can't convert string to array
    temp = @photo.tag_list.join(',')

SELECT * FROM `photos` WHERE (`photos`.`id` = 1 AND (`photos`.user_id = 1))
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE (`tags`.`id` = 6 AND ((`taggings`.taggable_type = 'Photo') AND (`taggings`.taggable_id = 1)))
---
  def remove_tag
    @photo = @logged_in_user.photos.find(params[:id])
    @tag_to_delete = @photo.tags.find(params[:tag_id])