app/controllers/user_tags_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    @user = User.find(params[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @user = User.find(params[:user_id])